[M_Iris_RaidPete MissionDefinition]
MissionName="Pete is a failed arsonist"
MissionDescription="Pete, you've been training since your last fight. Find some friends and fight him again..<br><br>Learn how to get great abs. It's hard when friends come.."
TurnInDescription="Press the button again to fight impossible pets. Note that you can only do this once a day.."
MissionSummary="Learn how to find and defeat the unstoppable Ringo."
MissionGiver="movements"
MissionTurnInLocation="Moxie"
TeaserText="Pit pyroman trains.."

[M_Iris_RaidPete:FindPost MissionObjectiveDefinition]
ProgressMessage="Use attack control panel"

[M_Iris_RaidPete:KillRaidPete MissionObjectiveDefinition]
ProgressMessage="Beat the invincible Pete"

[M_Iris_RaidPete:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Iris_RaidPete:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

